{
    "displayId": "001",
    "firstName": "LUNGA",
    "lastName": "MBATHA",
    "shortBio": "I am a software engineer with a strong foundation in Java and Spring Boot, experienced in building scalable backend systems. I enjoy solving real world problems through clean architecture, well structured APIs, and continuous learning. Driven by curiosity, I am actively growing my skills in cloud native development and modern backend practices. I am currently preparing for the AWS Certified Developer – Associate certification and am motivated to contribute to teams building impactful, production ready applications.",
    "detailedBio": [
        "I hold an Advanced Diploma in ICT, and I have hands-on experience developing both personal and collaborative software projects using modern technologies. My academic background provided a strong foundation in programming principles, databases, and systems development, which I have continued to build on through hands-on projects and self-driven learning.\n\n",
        "In addition to development work, I have experience in teaching and facilitation roles, including working as a Teacher Assistant and a Facilitator/Assessor. These roles strengthened my ability to communicate technical concepts clearly, produce structured documentation, and collaborate effectively with people of varying technical backgrounds. They also helped me develop patience, leadership, and problem-solving skills that translate well into software engineering teams.",
        "I enjoy working with technologies such as Spring Boot, RESTful APIs, and relational databases to design clean, maintainable systems. I am currently preparing for the AWS Certified Developer – Associate certification as part of my goal to deepen my understanding of scalable, production ready applications and modern cloud platforms."
    ],
    "socials": {
        "github": "https://github.com/lungashandu",
        "linkedin": "https://www.linkedin.com/in/lunga-mbatha-960b90a8/",
        "twitter": "https://x.com/LungaShandu"
    }
}